package loop;
//고대 그리스에 아주 현명하다고 소문난 노인이 살고 있었습니다.
//왕이 그 소문을 듣고 얼마나 현명한지 테스트 해보기 위해서 방문했습니다.
//
//왕이 다음과 같이 말했습니다.
//
//원하는 게 있다면 하나만 말해봐라! 내가 다 들어줄게!
//
//현명한 노인이 잠시 고민을 하더니 다음과 같이 말했습니다
//
//전하, 저는 욕심이 진짜 하나도 없습니다
//굳이 말하라고 하시니까 하나만 말하겠습니다.
//금화 1닢만 주세요. 그리고 그 다음날 전날의 2배를 주세요.
//이렇게 40일만 주십시오!
//
//왕이 이야기를 듣더니 정말 욕심이 없다며 들어주라고 지시하고 갔습니다.
//그리고 왕국은 파산했습니다.
//
//이 노인이 일자별로 받게되는 금화의 개수를 구하여 출력하세요
//이 나라에서는 하루에 금화를 1천닢 이상 쓸 수 없도록 법이 존재
// 법에 위반되는 날짜가 몇일?
// 총 받게되는 금화?
public class Test07현명한노인2 {
	public static void main(String[] args) {		
//40일이 주어진 이유 : 40일부터 숫자가 커지기 때문에 int형의 범위를 넘게된다.
// 기준을 둘 중 하나로 고르거나(일차 or 개수) 둘 다 고르거나
		
		long money = 1L;  // long형 숫자에는 'l' or 'L' 붙이는 거 잊지말기 
		
		
		for(int day =1; day <=40; day++) {
			System.out.println(day + "일차 : " + money + "개");
			money *=2;
		}
		
//		for(long money = 1; money <= 549755813888L; money *= 2) {
//			System.out.println("?일차 :" +money+ "개");
//		}
		
		// 일반적으로 코드가 가로로 긴 코드는 별로 좋지 않음
		// 코드가 세로로 길어야 좋은 코드 // 세로는 줄일 수 있기 때문에
//		for(long day =1, money = 1 ; day <40; day++, money *=2) { // 별로 선호하지 않음.. 복잡함
//			System.out.println(day + "일차 : "); //한 줄에 많이 쓰는 걸 원하지 않음, day는 int형으로 같은 라인에 생성못함
//		}
		
		
		
		
	}
}