package api.string2;

public class Test06비밀번호검사 {
	public static void main(String[] args) {
		//비밀번호 검사
		//-반드시 1글자 이상 포함된다는 것을 정규표현식으로 구현해야함
		//-파트별로 검사를 나눠서 하는 방법과 전체를 한번에 하는 방법이 있음
		//- 알파벳 대문자, 소문자, 숫자 ,특수문자를 반드시 1개 포함하여 8~16자로 구현
		
		String password = "Khacademy1!";
		
		String regex = "^(?=.*?[A-Z]+)(?=.*?[a-z]+)(?=.*?[0-9]+)(?=.*?[!@#$]+)[A-Za-z0-9!@#$]{8,16}$"; //대문자 1개이상
		//String regex = "^(?=.*?[A-Z]+)(?=.*?[a-z]+)(?=.*?[0-9]+)(?=.*?[\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\]\{\}\'\"\`\~\<\>\.\,\/\?\\\|]+)[A-Za-z0-9\!\@\#\$\%\^\&\*\(\)\-\_\=\+\[\]\{\}\'\"\`\~\<\>\.\,\/\?\\\|]{8,16}$";
		boolean valid = password.matches(regex);
		
			System.out.println("검사결과 = " + valid);
	}
}
