package api.string2;

public class Test04생년월일검사 {
	public static void main(String[] args) {
//		날짜 형식은 YYYY-MM-DD 형식
//		연도(YYYY)는 1900부터 2099까지 설정 가능
//		월(MM)은 01부터 12까지 설정 가능
//		일(DD)은 01부터 31까지 설정 가능
//
//		최초 구현 시 월 상관없이 모든 달이 31까지 일자를 설정할 수 있게 구현하세요.
//		다 구현하고 나서 월별로 28, 30, 31을 구분하여 설정할 수 있도록 업그레이드 하시기 바랍니다.
//
//		윤년은 프로그래밍으로밖에 구할 수 없습니다 (배수 판정 때문)
//		윤년을 고려하려면 어떻게 해야되는지 가장 마지막에 추가해보세요
		String date = "1998-02-31";
		
		String regex31 ="^(19|20)[0-9][0-9]\\-(0[1-9]|1[0-2])\\-([0-2][1-9]|3[0-1])$";
		String regex30 ="^(19|20)[0-9][0-9]\\-(0[1-9]|1[0-2])\\-([0-2][1-9]|30)$";
		String regex29 ="^(19|20)[0-9][0-9]\\-(0[1-9]|1[0-2])\\-[0-2][1-9]$";
		String regex28 ="^(19|20)[0-9][0-9]\\-(0[1-9]|1[0-2])\\-[0-2][1-8]$";
		boolean valid = date.matches(regex31);
		
		String[] month31 = new String[] {"01", "03", "05", "07", "08", "10", "12"}; 
		String[] month30 = new String[] {"02", "04", "06", "09", "11"};
		
		
		 
		System.out.println(valid);
	}
}
